{
    "customers": [
        {
            "id": 1,
            "name": "João da Silva",
            "photo": "https://ui-avatars.com/api/?name=Joao+Silva",
            "company": "ACME INC",
            "lastConversations": [
                {
                    "channel": 1,
                    "finishedAt": 1591627269
                },
                {
                    "channel": 1,
                    "finishedAt": 1591628768
                },
                {
                    "channel": 4,
                    "finishedAt": 1591651568
                }
            ],
            "observations": "Mussum Ipsum, cacilds vidis litro abertis. Casamentiss faiz malandris se pirulitá. Quem num gosta di mim que vai caçá sua turmis! Paisis, filhis, espiritis santis. Quem manda na minha terra sou euzis!",
            "contacts": [
                {
                    "channel": 1,
                    "value": "55 (19) 1234-5678"
                },
                {
                    "channel": 2,
                    "value": "joao@silva.com.br"
                },
                {
                    "channel": 4,
                    "value": "@joao_silva"
                }
            ]
        },
        {
            "id": 2,
            "name": "Maria da Silva",
            "photo": "https://ui-avatars.com/api/?name=Maria+Silva",
            "company": "VulcaNet",
            "lastConversations": [
                {
                    "type": 2,
                    "finishedAt": 1591627279
                },
                {
                    "type": 1,
                    "finishedAt": 1591628728
                },
                {
                    "type": 4,
                    "finishedAt": 1591651518
                }
            ],
            "observations": "Mussum Ipsum, cacilds vidis litro abertis. Si num tem leite então bota uma pinga aí cumpadi! In elementis mé pra quem é amistosis quis leo. Nullam volutpat risus nec leo commodo, ut interdum diam laoreet. Sed non consequat odio. Sapien in monti palavris qui num significa nadis i pareci latim.",
            "contacts": [
                {
                    "type": 1,
                    "value": "55 (19) 1234-5678"
                },
                {
                    "type": 2,
                    "value": "maria@silva.com.br"
                },
                {
                    "type": 4,
                    "value": "@maria_silva"
                }
            ]
        }
    ],
    "contacts": [
        {
            "channel": 1,
            "type": "whatsapp"
        },
        {
            "channel": 2,
            "type": "email"
        },
        {
            "channel": 3,
            "type": "telefone"
        },
        {
            "channel": 4,
            "type": "skype"
        },
        {
            "channel": 5,
            "type": "webchat"
        }
    ],
    "chats": [
        {
            "id": 1,
            "customer": 1,
            "channel": 1,
            "subject": null,
            "start": 1594388082,
            "messages": [
                {
                    "seen": true,

                    "timestamp": 1594388082,
                    "body": "Mussum Ipsum, cacilds vidis litro abertis. Mauris nec dolor in eros commodo tempor. Aenean aliquam molestie leo, vitae iaculis nisl. Todo mundo vê os porris que eu tomo, mas ninguém vê os tombis que eu levo! Quem num gosta di mim que vai caçá sua turmis! In elementis mé pra quem é amistosis quis leo.",
                    "type": "incoming"
                },
                {
                    "seen": true,
                    "timestamp": 1594388083,
                    "body": "Mussum Ipsum, cacilds vidis litro abertis. Detraxit consequat et quo num tendi nada. Nullam volutpat risus nec leo commodo, ut interdum diam laoreet. Sed non consequat odio. A ordem dos tratores não altera o pão duris. Cevadis im ampola pa arma uma pindureta.",
                    "type": "outgoing"
                },
                {
                    "seen": false,
                    "timestamp": 1594388084,
                    "body": "Mussum Ipsum, cacilds vidis litro abertis. Manduma pindureta quium dia nois paga. Suco de cevadiss, é um leite divinis, qui tem lupuliz, matis, aguis e fermentis. Atirei o pau no gatis, per gatis num morreus. Posuere libero varius. Nullam a nisl ut ante blandit hendrerit. Aenean sit amet nisi.",
                    "type": "incoming"
                }
            ]
        },
        {
            "id": 2,
            "customer": 1,
            "channel": 2,
            "subject": "Suspensão Freelander 2",
            "start": 1594388082,
            "messages": [
                {
                    "seen": false,
                    "timestamp": 1594388082,
                    "body": "Mussum Ipsum, cacilds vidis litro abertis. Não sou faixa preta cumpadi, sou preto inteiris, inteiris. Nec orci ornare consequat. Praesent lacinia ultrices consectetur. Sed non ipsum felis. Quem num gosta di mim que vai caçá sua turmis! A ordem dos tratores não altera o pão duris.",
                    "type": "incoming"
                }
            ]
        },
        {
            "id": 3,
            "customer": 2,
            "channel": 2,
            "subject": "Procedimento de troca",
            "start": 1594388081,
            "messages": [
                {
                    "seen": true,
                    "timestamp": 1594388081,
                    "body": "Mussum Ipsum, cacilds vidis litro abertis. Não sou faixa preta cumpadi, sou preto inteiris, inteiris. Cevadis im ampola pa arma uma pindureta. Suco de cevadiss, é um leite divinis, qui tem lupuliz, matis, aguis e fermentis. Nec orci ornare consequat. Praesent lacinia ultrices consectetur. Sed non ipsum felis.",
                    "type": "incoming"
                },
                {
                    "seen": true,
                    "timestamp": 1594388082,
                    "body": "Mussum Ipsum, cacilds vidis litro abertis. Todo mundo vê os porris que eu tomo, mas ninguém vê os tombis que eu levo! Mais vale um bebadis conhecidiss, que um alcoolatra anonimis. Quem num gosta di mé, boa gentis num é. Praesent malesuada urna nisi, quis volutpat erat hendrerit non. Nam vulputate dapibus.",
                    "type": "outgoing"
                }
            ]
        }
    ],
    "user":
    {
        "name": "Carlos Correa",
        "user": "carloscorrea",
        "password": "carloscorrea",
        "company": "Premium peças",
        "photo": "https://ui-avatars.com/api/?name=Carlos+Correa"
    }

}
